#define _CRT_SECURE_NO_WARNINGS 1
//奇偶序列

//问题描述
//输入一个整数组成的序列，然后将序列中的奇数位置结点依序放在前面，偶数位置结点依序放在后面，组成一个新的序列。输出此新序列。

//问题输入
//输入共两行，第一行是一个正整数n，表示序列长度，n < 100。第二行是n个整数，中间用空格隔开，表示序列中的元素。

//问题输出
//在一行上输出新生成的序列，数字中间用空格隔开。

//输入样例

/*
7
10 2 30 4 50 60 7
*/

//输出样例
//10 30 50 7 2 4 60


#include<stdio.h>

int main() {
	int a[101] = {0}, n, i;
	scanf("%d", &n);
	for (i = 1; i <= n; i++)
	{
		scanf("%d", &a[i]);
	}

	for (i = 1; i <= n; )
	{
		printf("%d ", a[i]);
		i = i + 2;
	}
	for (i = 2; i <= n; )
	{
		printf("%d ", a[i]);
		i = i + 2;
	}


	return 0;
}